let Timeframe = ago(1h);
let FailureThreshold = {Enter Threshold};
SecurityEvent
| where TimeGenerated > Timeframe
| where EventID == 4625
| summarize dcount(Account) by Computer, bin(TimeGenerated, 5m)
| where dcount_Account > FailureThreshold
