DeviceProcessEvents
| where  InitiatingProcessFileName in~ ("powershell.exe","reg.exe", "regedit.exe", "cmd.exe","winword.exe","excel.exe","powerpnt.exe")
| where FileName  in ("schtasks.exe", "at.exe")
